In [70]:
import pandas as pd
import sqlite3
import os.path
from sqlalchemy import create_engine

In [57]:
conn = create_engine('sqlite:///../dataset/ijcai_cff_2017.db')

def upload_csv_to_sqlite(file_name, col_names):
    try:
        df = pd.read_sql_query(sql = 'select * from ' + file_name + ' limit 1', con=conn)
        print("Table "+ file_name+" already present")
        return
    except:
        pass
    total_rows = 0
    for df in pd.read_csv('../dataset/'+file_name+'.txt.gz', 
                          compression='gzip', chunksize=5000000, 
                          iterator=True, encoding='utf-8',
                          names=col_names                         
                         ):
        df.to_sql(file_name, conn, if_exists='append',index=False)
        
        total_rows += df.shape[0] 
        print ('For file '+ file_name+' completed {} rows'.format(total_rows))

In [58]:
upload_csv_to_sqlite("shop_info", ("shop_id","city_name",
                                   "location_id", "per_pay",
                                   "score","comment_cnt", "shop_level",
                                   "cate_1_name","cate_2_name","cate_3_name"
                                  ))
upload_csv_to_sqlite("user_view", ("user_id", "shop_id", "time_stamp"))
upload_csv_to_sqlite("user_pay", ("user_id", "shop_id", "time_stamp"))

For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 5000000 rows
For file user_pay completed 4674110 rows

In [22]:
import pickle
def create_sample_pickle(sql_query, pickle_file_name):
    df = pd.read_sql_query(sql=sql_query,con=conn)
    pickle.dump(df, open("../dataset/"+pickle_file_name,"wb"))

In [46]:
pd.read_sql_query("select * from shop_info limit 10", con = conn)

,shop_id,city_name,location_id,per_pay,score,comment_cnt,shop_level,cate_1_name,cate_2_name,cate_3_name
0,1,湖州,885,8,4.0,12.0,2,美食,休闲茶饮,饮品/甜点
1,2,哈尔滨,64,19,NaN,NaN,1,超市便利店,超市,None
2,3,南昌,774,5,3.0,2.0,0,美食,休闲茶饮,奶茶
3,4,天津,380,18,NaN,NaN,1,超市便利店,超市,None
4,5,杭州,263,2,2.0,2.0,0,美食,休闲食品,生鲜水果
5,6,大连,1139,13,3.0,1.0,0,美食,烘焙糕点,面包
6,7,绍兴,145,13,3.0,9.0,2,美食,快餐,西式快餐
7,8,杭州,234,16,3.0,1.0,0,美食,休闲食品,生鲜水果
8,9,杭州,1120,15,4.0,0.0,1,超市便利店,超市,None
9,10,孝感,98,10,NaN,NaN,0,超市便利店,超市,None

In [60]:
pd.read_sql_query("select * from user_view limit 10", con = conn)

    user_id  shop_id           time_stamp
0  13201967     1197  2016-10-21 18:00:00
1  19461365     1197  2016-06-28 23:00:00
2  15022321     1197  2016-07-16 19:00:00
3   5440872     1197  2016-07-15 07:00:00
4  12594529     1197  2016-08-07 16:00:00
5   5440872     1197  2016-08-12 08:00:00
6  19918044     1197  2016-09-03 16:00:00
7   9476039     1197  2016-09-04 17:00:00
8   4081995     1197  2016-09-25 10:00:00
9  12594529     1197  2016-08-07 16:00:00

In [59]:
pd.read_sql_query("select * from user_pay limit 10", con = conn)

    user_id  shop_id           time_stamp
0  22127870     1862  2015-12-25 17:00:00
1   3434231     1862  2016-10-05 11:00:00
2  16955285     1862  2016-02-10 15:00:00
3  13799128     1862  2016-01-13 14:00:00
4  13799128     1862  2016-07-05 12:00:00
5  20244878     1862  2016-09-17 15:00:00
6  20244878     1862  2016-05-29 16:00:00
7    438444     1862  2016-02-22 17:00:00
8  22003193     1862  2016-08-07 15:00:00
9  20244878     1862  2016-04-17 16:00:00

In [65]:
query1 = "select max(shop_id), min(shop_id),\
        avg(shop_id) from shop_info";

In [66]:
pd.read_sql_query(query1, conn)

   max(shop_id)  min(shop_id)  avg(shop_id)
0          2000             1        1000.5

In [76]:
import random
sample_shop_ids = [random.randint(1, 1000) for i in range(1,10)]
sample_shop_ids

[744, 177, 402, 71, 748, 212, 227, 830, 619]

In [87]:
conn.execute("drop table sample_user_pay")
conn.execute("create table sample_user_pay \
AS select * from user_pay where \
shop_id in " + 
            str(sample_shop_ids)
            .replace("[", "(")
            .replace("]",")"))

In [84]:
conn.execute("drop table sample_user_view")
conn.execute("create table sample_user_view \
AS select * from user_view where \
shop_id in " + 
            str(sample_shop_ids)
            .replace("[", "(")
            .replace("]",")"))

In [ ]:
conn.execute("drop table sample_shop_info")
conn.execute("create table sample_shop_info \
AS select * from shop_info where \
shop_id in " + 
            str(sample_shop_ids)
            .replace("[", "(")
            .replace("]",")"))

In [85]:
pd.read_sql("select count(*) from sample_user_pay", conn)

   count(*)
0    279356

In [86]:
pd.read_sql("select count(*) from sample_user_view", conn)

   count(*)
0     28851

In [ ]:
pd.read_sql("select count(*) from sample_shop_view", conn)